# EngagementLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..EngagementLength Property
Connector Class See Also
---
Connector engagement length. When applicable, it represents the inset distance to the end of the fabrication part from the connection point. Otherwise it returns zero.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double EngagementLength { get; }
```

Visual Basic
---
```text
Public ReadOnly Property EngagementLength As Double
	Get
```

Visual C++
---
```text
public:
property double EngagementLength {
	double get ();
}
```

# See Also
Connector Class
Autodesk.Revit.DB Namespace